#include <stdio.h>
int main(void)
{
    int num = 0, j = 9, result = 0;
    printf("숫자를 입력하세요:  ");
    scanf("%d", &num); // 왜 입력한 값이 num이 되지?

    while(num>0)
    {
        while(j>0)
        {
            result = num * j;
            printf("%d * %d = %d \n", num, j, result);
            j--;
        }
        num--;
        j = 9;
        printf("------\n");
    }

    return 0;
}

/*
숫자를 입력하세요:  3
3 * 9 = 27 
3 * 8 = 24 
3 * 7 = 21 
3 * 6 = 18 
3 * 5 = 15 
3 * 4 = 12 
3 * 3 = 9 
3 * 2 = 6 
3 * 1 = 3 
------
2 * 9 = 18 
2 * 8 = 16 
2 * 7 = 14 
2 * 6 = 12 
2 * 5 = 10 
2 * 4 = 8 
2 * 3 = 6 
2 * 2 = 4 
2 * 1 = 2 
------
1 * 9 = 9 
1 * 8 = 8 
1 * 7 = 7 
1 * 6 = 6 
1 * 5 = 5 
1 * 4 = 4 
1 * 3 = 3 
1 * 2 = 2 
1 * 1 = 1 
------ 
*/
